amarildolacerda/bridge_python/clients/esp8266_on_off/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ArduinoJson.h>
#include <WiFiManager.h>
#include <PubSubClient.h>
#include <WiFiUdp.h>
#include "config.h"

static const char *TAG = "esp8266-mqtt-bridge";

static WiFiClient s_wifi_client;
static PubSubClient s_mqtt_client(s_wifi_client);
static WiFiUDP s_udp;

static unsigned long s_last_state_update = 0;
static unsigned long s_last_telemetry_update = 0;
static unsigned long s_last_reconnect_attempt = 0;
static unsigned long s_last_broadcast_check = 0;

// Device state
static bool s_onoff_state = false;
static float s_temperature = 25.0;
static float s_humidity = 50.0;
static int s_dimmer_level = 128;
static int s_battery = 100;
static unsigned long s_start_time = 0;

// MQTT Broker info
static char s_mqtt_broker[64] = "192.168.1.100";
static uint16_t s_mqtt_port = MQTT_PORT;
static bool s_mqtt_connected = false;
static bool s_bridge_discovered = false;

// WiFi state
static bool s_wifi_configuration_mode = false;
static unsigned long s_wifi_config_start_time = 0;

// Button handling
volatile bool s_button_pressed = false;
volatile unsigned long s_last_interrupt = 0;

// Forward declarations
static void button_isr(void);
static void send_state(void);
static void send_telemetry(void);
static void send_event(const char *event, const char *severity);
static bool send_discovery_request(void);
static void maintain_bridge_discovery(void);

// Convert device type number to string (compatible with bridge)
static const char *get_device_type_string(void)
{
#if DEVICE_TYPE == DEVICE_TYPE_ONOFF
    return "light_switch";
#elif DEVICE_TYPE == DEVICE_TYPE_TEMPERATURE
    return "temperature_sensor";
#elif DEVICE_TYPE == DEVICE_TYPE_CONTACT
    return "door_sensor";
#elif DEVICE_TYPE == DEVICE_TYPE_OCCUPANCY
    return "motion_sensor";
#elif DEVICE_TYPE == DEVICE_TYPE_DIMMABLE
    return "light_dimmer";
#else
    return "sensor";
#endif
}

// MQTT Callback for incoming commands
static void mqtt_callback(char *topic, byte *payload, unsigned int length)
{
    String message;
    for (unsigned int i = 0; i < length; i++)
    {
        message += (char)payload[i];
    }

    Serial.printf("[%s] 📨 Command received on topic: %s\n", TAG, topic);
    Serial.printf("[%s] Message: %s\n", TAG, message.c_str());

    DynamicJsonDocument doc(256);
    DeserializationError error = deserializeJson(doc, message);

    if (error)
    {
        Serial.printf("[%s] ❌ JSON parse error: %s\n", TAG, error.c_str());
        return;
    }

    // Handle different command formats
    const char *action = doc["action"];

    if (action != nullptr)
    {
        // New format from ping_mqtt.py
        if (strcmp(action, "reboot") == 0)
        {
            Serial.printf("[%s] 🔄 Reboot command received\n", TAG);
            send_event("device_rebooting", "warning");
            delay(500);
            ESP.restart();
        }
        else if (strcmp(action, "set_interval") == 0)
        {
            int interval = doc["params"]["interval"];
            Serial.printf("[%s] ⏰ Set interval command: %d\n", TAG, interval);
        }
        else if (strcmp(action, "calibrate") == 0)
        {
            const char *type = doc["params"]["type"];
            Serial.printf("[%s] 🔧 Calibrate command: %s\n", TAG, type);
        }
        else if (strcmp(action, "set_onoff") == 0)
        {
            bool new_state = doc["params"]["state"];
            s_onoff_state = new_state;

#ifdef RELAY_PIN
            digitalWrite(RELAY_PIN, s_onoff_state ? HIGH : LOW);
#endif

            Serial.printf("[%s] 💡 Switch turned: %s\n", TAG, s_onoff_state ? "ON" : "OFF");
            send_state();
            send_event(s_onoff_state ? "device_turned_on" : "device_turned_off", "info");
        }
        else if (strcmp(action, "set_level") == 0)
        {
            s_dimmer_level = doc["params"]["level"];

#ifdef RELAY_PIN
            analogWriteRange(1023);
            analogWrite(RELAY_PIN, map(s_dimmer_level, 0, 254, 0, 1023));
#endif

            Serial.printf("[%s] 🎚️ Dimmer level: %d\n", TAG, s_dimmer_level);
            send_state();
        }
    }
    else
    {
        // Legacy format
        const char *command = doc["command"];
        const char *cluster = doc["cluster"];

        if (cluster != nullptr && command != nullptr)
        {
            if (strcmp(cluster, "onoff") == 0 && strcmp(command, "set_onoff") == 0)
            {
                s_onoff_state = doc["data"];

#ifdef RELAY_PIN
                digitalWrite(RELAY_PIN, s_onoff_state ? HIGH : LOW);
#endif

                Serial.printf("[%s] 💡 Relay turned: %s\n", TAG, s_onoff_state ? "ON" : "OFF");
                send_state();
            }
            else if (strcmp(cluster, "levelcontrol") == 0 && strcmp(command, "set_level") == 0)
            {
                s_dimmer_level = doc["data"];

#ifdef RELAY_PIN
                analogWriteRange(1023);
                analogWrite(RELAY_PIN, map(s_dimmer_level, 0, 254, 0, 1023));
#endif

                Serial.printf("[%s] 🎚️ Dimmer level: %d\n", TAG, s_dimmer_level);
                send_state();
            }
            else if (strcmp(cluster, "system") == 0 && strcmp(command, "restart") == 0)
            {
                Serial.printf("[%s] 🔄 Restart command received\n", TAG);
                send_event("device_rebooting", "warning");
                delay(500);
                ESP.restart();
            }
        }
    }
}

// Send device registration to bridge
static bool register_device(void)
{
    if (!s_mqtt_connected)
    {
        return false;
    }

    String topic = "mqtt-bridge/register";

    DynamicJsonDocument doc(256);
    doc["id"] = DEVICE_ID;
    doc["type"] = get_device_type_string();
    doc["name"] = DEVICE_NAME;
    doc["timestamp"] = time(nullptr);

    // Add metadata based on device type
    JsonObject metadata = doc.createNestedObject("metadata");
    metadata["firmware_version"] = "1.0.0";
    metadata["chip_id"] = ESP.getChipId();
    metadata["mac"] = WiFi.macAddress();

#ifdef RELAY_PIN
    metadata["relay_pin"] = RELAY_PIN;
#endif

    String output;
    serializeJson(doc, output);

    Serial.printf("[%s] 📝 Registering device: %s\n", TAG, DEVICE_ID);

    if (s_mqtt_client.publish(topic.c_str(), output.c_str(), true))
    {
        Serial.printf("[%s] ✅ Device registered successfully\n", TAG);
        return true;
    }
    else
    {
        Serial.printf("[%s] ❌ Failed to register device\n", TAG);
        return false;
    }
}

// Send device state to bridge
static void send_state(void)
{
    if (!s_mqtt_connected)
    {
        Serial.printf("[%s] ⚠️ Cannot send state, MQTT not connected\n", TAG);
        return;
    }

    String topic = String("mqtt-bridge/") + DEVICE_ID + "/state";

    DynamicJsonDocument doc(256);
    doc["device_id"] = DEVICE_ID;
    doc["timestamp"] = time(nullptr);

    const char *type = get_device_type_string();

    if (strcmp(type, "light_switch") == 0)
    {
        doc["state"] = s_onoff_state ? "ON" : "OFF";
        doc["power"] = s_onoff_state ? 5.2 : 0.1;
    }
    else if (strcmp(type, "light_dimmer") == 0)
    {
        doc["state"] = s_onoff_state ? "ON" : "OFF";
        doc["brightness"] = map(s_dimmer_level, 0, 254, 0, 100);
        doc["level"] = s_dimmer_level;
    }
    else if (strcmp(type, "temperature_sensor") == 0)
    {
        doc["temperature"] = s_temperature;
        doc["humidity"] = s_humidity;
        doc["battery"] = s_battery;
    }
    else if (strcmp(type, "door_sensor") == 0)
    {
        doc["open"] = s_onoff_state;
        doc["contact"] = !s_onoff_state;
    }
    else if (strcmp(type, "motion_sensor") == 0)
    {
        doc["motion"] = s_onoff_state;
        doc["occupancy"] = s_onoff_state;
        if (s_onoff_state)
        {
            doc["since"] = time(nullptr);
        }
    }

    String output;
    serializeJson(doc, output);

    if (s_mqtt_client.publish(topic.c_str(), output.c_str()))
    {
        Serial.printf("[%s] 📤 State published\n", TAG);
    }
    else
    {
        Serial.printf("[%s] ❌ Failed to publish state\n", TAG);
    }
}

// Send telemetry data to bridge
static void send_telemetry(void)
{
    if (!s_mqtt_connected)
    {
        return;
    }

