amarildolacerda/bridge_python/clients/esp8266_on_off/src/main.cpp
    String topic = String("mqtt-bridge/") + DEVICE_ID + "/telemetry";

    DynamicJsonDocument doc(256);
    doc["device_id"] = DEVICE_ID;
    doc["timestamp"] = time(nullptr);
    doc["rssi"] = WiFi.RSSI();
    doc["uptime"] = (millis() - s_start_time) / 1000;
    doc["free_heap"] = ESP.getFreeHeap();
    doc["free_sketch_space"] = ESP.getFreeSketchSpace();
    doc["reset_reason"] = ESP.getResetReason();

    String output;
    serializeJson(doc, output);

    if (s_mqtt_client.publish(topic.c_str(), output.c_str()))
    {
        Serial.printf("[%s] 📡 Telemetry published (RSSI: %d dBm)\n", TAG, WiFi.RSSI());
    }
}

// Send event to bridge
static void send_event(const char *event, const char *severity)
{
    if (!s_mqtt_connected)
    {
        return;
    }

    String topic = String("mqtt-bridge/") + DEVICE_ID + "/event";

    DynamicJsonDocument doc(256);
    doc["device_id"] = DEVICE_ID;
    doc["timestamp"] = time(nullptr);
    doc["event"] = event;
    doc["severity"] = severity;

    String output;
    serializeJson(doc, output);

    if (s_mqtt_client.publish(topic.c_str(), output.c_str()))
    {
        Serial.printf("[%s] ⚡ Event published: %s (%s)\n", TAG, event, severity);
    }
}

// Subscribe to command topic
static void subscribe_to_commands(void)
{
    String topic = String("mqtt-bridge/") + DEVICE_ID + "/command";

    if (s_mqtt_client.subscribe(topic.c_str()))
    {
        Serial.printf("[%s] ✅ Subscribed to: %s\n", TAG, topic.c_str());
    }
    else
    {
        Serial.printf("[%s] ❌ Failed to subscribe to: %s\n", TAG, topic.c_str());
    }
}

// Maintain bridge discovery by listening to UDP broadcasts and re-requesting periodically
static void maintain_bridge_discovery(void)
{
    unsigned long now = millis();

    if (now - s_last_broadcast_check < 100)
    {
        return;
    }
    s_last_broadcast_check = now;

    // Check for incoming UDP packets
    int packet_size = s_udp.parsePacket();
    if (packet_size)
    {
        char buffer[512];
        int len = s_udp.read(buffer, sizeof(buffer) - 1);
        buffer[len] = '\0';

        String response = String(buffer);

        DynamicJsonDocument doc(512);
        DeserializationError error = deserializeJson(doc, response);

        if (!error && doc.containsKey("service"))
        {
            if (strcmp(doc["service"], "mqtt-bridge") == 0)
            {
                const char *mqtt_ip = doc["ip_sta"];
                int mqtt_port = doc["mqtt_port"];

                if (mqtt_ip != nullptr && strlen(mqtt_ip) > 0 && mqtt_port > 0)
                {
                    bool info_changed = (strcmp(s_mqtt_broker, mqtt_ip) != 0) || (s_mqtt_port != mqtt_port);

                    if (info_changed || !s_bridge_discovered)
                    {
                        strcpy(s_mqtt_broker, mqtt_ip);
                        s_mqtt_port = mqtt_port;
                        s_bridge_discovered = true;

                        Serial.printf("\n[%s] 🔄 Bridge info updated:\n", TAG);
                        Serial.printf("[%s]    IP: %s\n", TAG, s_mqtt_broker);
                        Serial.printf("[%s]    MQTT Port: %d\n", TAG, s_mqtt_port);

                        if (doc.containsKey("name"))
                            Serial.printf("[%s]    Name: %s\n", TAG, doc["name"].as<const char *>());
                        if (doc.containsKey("device_count"))
                            Serial.printf("[%s]    Devices: %d\n", TAG, doc["device_count"].as<int>());

                        if (s_mqtt_connected)
                        {
                            s_mqtt_client.disconnect();
                            s_mqtt_connected = false;
                        }
                    }
                }
            }
        }
    }

    // Periodic active re-discovery if bridge not found or MQTT keeps failing
    static unsigned long last_active_discovery = 0;
    if (!s_mqtt_connected && now - last_active_discovery > 30000)
    {
        last_active_discovery = now;
        send_discovery_request();
    }
}

static bool parse_bridge_response(const char *buffer, int len)
{
    DynamicJsonDocument doc(512);
    DeserializationError error = deserializeJson(doc, buffer);

    if (error) return false;
    if (!doc.containsKey("service") || strcmp(doc["service"], "mqtt-bridge") != 0) return false;

    const char *mqtt_ip = doc["ip_sta"];
    int mqtt_port = doc["mqtt_port"];

    if (!mqtt_ip || strlen(mqtt_ip) == 0 || mqtt_port <= 0) return false;

    strcpy(s_mqtt_broker, mqtt_ip);
    s_mqtt_port = mqtt_port;
    s_bridge_discovered = true;

    Serial.printf("\n[%s] ✅ MQTT Bridge discovered!\n", TAG);
    Serial.printf("[%s] =========================================\n", TAG);
    Serial.printf("[%s] Bridge IP: %s\n", TAG, s_mqtt_broker);
    Serial.printf("[%s] MQTT Port: %d\n", TAG, s_mqtt_port);
    if (doc.containsKey("name"))
        Serial.printf("[%s] Bridge Name: %s\n", TAG, doc["name"].as<const char *>());
    if (doc.containsKey("http_port"))
        Serial.printf("[%s] HTTP Port: %d\n", TAG, doc["http_port"].as<int>());
    if (doc.containsKey("device_count"))
        Serial.printf("[%s] Devices count: %d\n", TAG, doc["device_count"].as<int>());
    Serial.printf("[%s] =========================================\n\n", TAG);
    return true;
}

static bool send_discovery_request()
{
    DynamicJsonDocument req(128);
    req["service"] = "mqtt-bridge";
    req["discover"] = true;
    String payload;
    serializeJson(req, payload);

    s_udp.beginPacket(IPAddress(255, 255, 255, 255), DISCOVERY_PORT);
    s_udp.write((const uint8_t *)payload.c_str(), payload.length());
    s_udp.endPacket();

    Serial.printf("[%s] 🔍 Active discovery request sent\n", TAG);
    return true;
}

static bool await_discovery_response(unsigned long timeout_ms)
{
    unsigned long start = millis();
    while (millis() - start < timeout_ms)
    {
        int packet_size = s_udp.parsePacket();
        if (packet_size)
        {
            char buffer[512];
            int len = s_udp.read(buffer, sizeof(buffer) - 1);
            buffer[len] = '\0';
            if (parse_bridge_response(buffer, len)) return true;
        }
        delay(10);
    }
    return false;
}

// UDP discovery for MQTT bridge (active request + passive listen)
static bool discover_mqtt_broker(void)
{
    // 1. Send active discovery request and wait for response
    send_discovery_request();
    if (await_discovery_response(5000))
    {
        return true;
    }

    // 2. Fall back to passive listening for periodic broadcasts
    Serial.printf("[%s] 🔍 No response to active request, listening for broadcasts on port %d...\n", TAG, DISCOVERY_PORT);

