amarildolacerda/bridge_python/clients/esp8266_on_off/src/main.cpp
    unsigned long start_time = millis();
    int attempts = 0;

    while (millis() - start_time < (unsigned long)DISCOVERY_TIMEOUT)
    {
        int packet_size = s_udp.parsePacket();
        if (packet_size)
        {
            char buffer[512];
            int len = s_udp.read(buffer, sizeof(buffer) - 1);
            buffer[len] = '\0';
            if (parse_bridge_response(buffer, len)) return true;
        }

        // Re-send active request every 5 seconds
        if (millis() - start_time > (attempts + 1) * 5000)
        {
            send_discovery_request();
        }

        delay(100);
        attempts++;

        if (attempts % 20 == 0)
        {
            Serial.printf("[%s] ⏳ Waiting for bridge broadcast... (%d/%d seconds)\n",
                          TAG, (millis() - start_time) / 1000, DISCOVERY_TIMEOUT / 1000);
        }
    }

    Serial.printf("[%s] ❌ MQTT bridge discovery timeout after %d ms\n",
                  TAG, DISCOVERY_TIMEOUT);
    return false;
}

// Maintain MQTT connection
static bool maintain_mqtt_connection(void)
{
    if (s_mqtt_client.connected())
    {
        s_mqtt_client.loop();
        return true;
    }

    unsigned long now = millis();
    if (now - s_last_reconnect_attempt < 5000)
    {
        return false;
    }
    s_last_reconnect_attempt = now;

    Serial.printf("[%s] 🔌 Connecting to MQTT broker %s:%d...\n", TAG, s_mqtt_broker, s_mqtt_port);

    s_mqtt_client.setServer(s_mqtt_broker, s_mqtt_port);
    s_mqtt_client.setCallback(mqtt_callback);
    s_mqtt_client.setBufferSize(1024);

    String client_id = String(DEVICE_ID) + "_" + String(ESP.getChipId());

    if (s_mqtt_client.connect(client_id.c_str()))
    {
        Serial.printf("[%s] ✅ MQTT Connected!\n", TAG);
        s_mqtt_connected = true;

        // Register device and subscribe to commands
        register_device();
        subscribe_to_commands();

        // Send initial events
        send_event("device_started", "info");
        send_telemetry();
        send_state();

        return true;
    }
    else
    {
        Serial.printf("[%s] ❌ MQTT connection failed, rc=%d\n", TAG, s_mqtt_client.state());
        s_mqtt_connected = false;
        return false;
    }
}

// WiFi Manager setup
static bool wifi_setup(bool force_config_portal = false)
{
    WiFiManager wifiManager;
    wifiManager.setConnectTimeout(20);

    if (!force_config_portal && WiFi.SSID() != "")
    {
        wifiManager.setTimeout(180);
        wifiManager.setConnectRetries(3);

        Serial.printf("[%s] 📡 Connecting to saved WiFi: %s\n", TAG, WiFi.SSID().c_str());

        if (wifiManager.autoConnect())
        {
            Serial.printf("[%s] ✅ WiFi connected! IP: %s\n", TAG, WiFi.localIP().toString().c_str());
            s_wifi_configuration_mode = false;
            return true;
        }

        Serial.printf("[%s] Failed to connect to saved WiFi\n", TAG);
    }

    Serial.printf("[%s] 🎯 Starting configuration portal...\n", TAG);
    s_wifi_configuration_mode = true;
    s_wifi_config_start_time = millis();

    wifiManager.setConfigPortalTimeout(300);

    WiFiManagerParameter custom_mqtt_broker("mqtt_broker", "MQTT Broker IP", s_mqtt_broker, 64);
    WiFiManagerParameter custom_mqtt_port("mqtt_port", "MQTT Port", String(s_mqtt_port).c_str(), 6);
    wifiManager.addParameter(&custom_mqtt_broker);
    wifiManager.addParameter(&custom_mqtt_port);

    if (wifiManager.startConfigPortal("ESP8266_MQTT_Bridge", "password123"))
    {
        if (strlen(custom_mqtt_broker.getValue()) > 0)
        {
            strcpy(s_mqtt_broker, custom_mqtt_broker.getValue());
            s_mqtt_port = atoi(custom_mqtt_port.getValue());
            Serial.printf("[%s] Manual MQTT config: %s:%d\n", TAG, s_mqtt_broker, s_mqtt_port);
        }

        s_wifi_configuration_mode = false;
        return true;
    }

    Serial.printf("[%s] Configuration portal timed out\n", TAG);
    s_wifi_configuration_mode = false;
    return false;
}

// Maintain WiFi connection
static void maintain_wifi_connection(void)
{
    if (WiFi.status() == WL_CONNECTED)
    {
        return;
    }

    unsigned long now = millis();
    if (now - s_last_reconnect_attempt < 30000)
    {
        return;
    }
    s_last_reconnect_attempt = now;

    Serial.printf("[%s] 📡 WiFi disconnected. Reconnecting...\n", TAG);
    WiFi.begin();

    unsigned long connect_start = millis();
    while (millis() - connect_start < 15000)
    {
        if (WiFi.status() == WL_CONNECTED)
        {
            IPAddress localIp = WiFi.localIP();
            Serial.printf("[%s] ✅ Reconnected! IP: %d.%d.%d.%d\n", TAG,
                          localIp[0], localIp[1], localIp[2], localIp[3]);
            return;
        }
        delay(500);
    }

    static unsigned long last_config_attempt = 0;
    if (now - last_config_attempt > 300000)
    {
        last_config_attempt = now;
        wifi_setup(true);
    }
}

// Read sensors
static void read_sensors(void)
{
#if DEVICE_TYPE == DEVICE_TYPE_TEMPERATURE
    static unsigned long last_sensor_read = 0;
    static float last_temp = 0;

    if (millis() - last_sensor_read > 2000)
    {
        // Simulate temperature/humidity readings
        s_temperature = 22.0 + (random(-30, 30) / 10.0);
        s_humidity = 50.0 + (random(-100, 100) / 10.0);

        // Simulate battery drain slowly
        static int counter = 0;
        counter++;
        if (counter > 100)
        {
            counter = 0;
            s_battery = max(0, s_battery - 1);
        }

        // Send event on significant temperature change
        if (abs(s_temperature - last_temp) > 1.0)
        {
            send_event("temperature_changed", "info");
            last_temp = s_temperature;
        }

        last_sensor_read = millis();
    }
#endif
}

// Button interrupt handler
#ifdef BUTTON_PIN
static ICACHE_RAM_ATTR void button_isr(void)
{
    unsigned long now = millis();
    if (now - s_last_interrupt > 300)
    {
        s_button_pressed = true;
        s_last_interrupt = now;
    }
}
#endif

// Initialize hardware
static void init_hardware(void)
{
#if DEVICE_TYPE == DEVICE_TYPE_ONOFF || DEVICE_TYPE == DEVICE_TYPE_DIMMABLE
#ifdef RELAY_PIN
    pinMode(RELAY_PIN, OUTPUT);
    digitalWrite(RELAY_PIN, LOW);
#endif

#ifdef BUTTON_PIN
    pinMode(BUTTON_PIN, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(BUTTON_PIN), button_isr, FALLING);
#endif
#endif

