amarildolacerda/bridge_python/clients/esp8266_on_off/src/main.cpp
#ifdef LED_PIN
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LOW);
#endif
}

// Check config portal timeout
static void check_config_portal_timeout(void)
{
    if (s_wifi_configuration_mode && (millis() - s_wifi_config_start_time > 600000))
    {
        Serial.printf("[%s] ⏰ Config portal timeout. Restarting...\n", TAG);
        ESP.restart();
    }
}

void setup(void)
{
    Serial.begin(115200);
    delay(1000);
    s_start_time = millis();

    Serial.printf("\n[%s] ╔══════════════════════════════════════════════════╗\n", TAG);
    Serial.printf("[%s] ║     ESP8266 MQTT Bridge Client v1.0              ║\n", TAG);
    Serial.printf("[%s] ╠══════════════════════════════════════════════════╣\n", TAG);
    Serial.printf("[%s] ║ Device ID: %-32s ║\n", TAG, DEVICE_ID);
    Serial.printf("[%s] ║ Device Name: %-30s ║\n", TAG, DEVICE_NAME);
    Serial.printf("[%s] ║ Device Type: %-30s ║\n", TAG, get_device_type_string());
    Serial.printf("[%s] ╚══════════════════════════════════════════════════╝\n\n", TAG);

    randomSeed(analogRead(A0));
    init_hardware();

    // Setup UDP for listening on broadcast port
    s_udp.begin(DISCOVERY_PORT);
    Serial.printf("[%s] 📻 UDP listener started on port %d\n", TAG, DISCOVERY_PORT);

    // Setup WiFi
    if (!wifi_setup(false))
    {
        Serial.printf("[%s] WiFi setup failed, restarting...\n", TAG);
        delay(5000);
        ESP.restart();
    }

    // Discover MQTT bridge by listening to broadcasts
    if (discover_mqtt_broker())
    {
        Serial.printf("[%s] ✅ Bridge discovered successfully!\n", TAG);
    }
    else
    {
        Serial.printf("[%s] ⚠️ Bridge discovery failed, using fallback config\n", TAG);
    }

    // Connect to MQTT
    maintain_mqtt_connection();

    Serial.printf("[%s] 🚀 System ready!\n\n", TAG);
}

void loop(void)
{
    check_config_portal_timeout();

    if (WiFi.status() != WL_CONNECTED)
    {
        maintain_wifi_connection();
        delay(1000);
        return;
    }

    // Keep listening for bridge announcements
    maintain_bridge_discovery();

    // Maintain MQTT connection
    maintain_mqtt_connection();

// Handle button press
#ifdef BUTTON_PIN
    if (s_button_pressed)
    {
        s_button_pressed = false;
        s_onoff_state = !s_onoff_state;

#ifdef RELAY_PIN
        digitalWrite(RELAY_PIN, s_onoff_state ? HIGH : LOW);
#endif

        Serial.printf("[%s] 🔘 Button pressed: %s\n", TAG, s_onoff_state ? "ON" : "OFF");
        send_state();
        send_event(s_onoff_state ? "button_pressed_on" : "button_pressed_off", "info");
    }
#endif

    unsigned long now = millis();

    // Periodic telemetry
    if (now - s_last_telemetry_update > TELEMETRY_INTERVAL)
    {
        s_last_telemetry_update = now;
        send_telemetry();
    }

    // Periodic state update
    if (now - s_last_state_update > STATE_UPDATE_INTERVAL)
    {
        s_last_state_update = now;
        read_sensors();
        send_state();
    }

// Blink LED to show activity (optional)
#ifdef LED_PIN
    static unsigned long last_blink = 0;
    if (s_mqtt_connected && (now - last_blink > 1000))
    {
        last_blink = now;
        digitalWrite(LED_PIN, !digitalRead(LED_PIN));
    }
#endif

    delay(10);
}